def illegal_prompt1(prompt: str):
    illegal_list = [
        "폭력", "살인", "총", "칼", "폭탄", "테러", "피", "싸움",
        "학대", "포르노", "성인", "성행위", "음란", "노출", "섹스", "유혹",
        "성기", "범죄", "마약", "약물", "중독", "자살", "낙태",
        "사기", "폭행", "도둑", "성폭행", "강간", "고문", "전쟁",
        "납치", "인신매매", "협박", "방화", "무기", "도발", "총기",
        "충격", "충돌", "피투성이", "모르핀", "해로인",
        "고통", "괴롭힘", "불법행위", "갱단", "대마", "담배",
        "시위", "소요", "탄압", "밀수", "밀매", "무단침입", "파괴행위", 
        "착취", "속임수", "기만", "불신", "위협", "경고", "펜타닐"
        "범법", "유괴", "폭동", "폭발", "탄환", "불태우다",
        "압수", "처형", "폭언", "비판", "모독", "명예훼손", "패륜",
        "살육", "테러리즘", "대량살상", "동물학대",
        "도둑질", "밀거래", "폭주", "패티쉬",
        "폭력배", "불법집회", "방종", "자해", "탈옥", "총격전", "연쇄살인", 
        "살인마", "전투", "위조", "윤석열", "문재인", "노무현", "박근혜",
        "파렴치", "동물학대", "불법거래", "성적학대", "부패", 
        "불법무기", "반사회적", "범죄행위", "찌르"
    ]

    found_illegal = False
    for word in illegal_list:
        if word in prompt:
            found_illegal = True
            break  # 금지된 단어를 발견하면 반복문 종료
    return found_illegal
